theoim/wsm_driver/examples/tcp_server_multi_socket/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 1 ms tick: the TOE poll loops (wiztoe_accept/recv) yield in 1 ms steps and
# count those steps for SO_RCVTIMEO/SO_SNDTIMEO. At the IDF default of 100 Hz a
# 1 ms delay truncates to 0 ticks, which busy-waits and starves the idle task.
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# Keep default warnings as warnings. ESP-IDF flipped this Kconfig default in 6.0
# (y in 5.5 -> n in 6.0). With it off the build uses -Werror instead of
# -Werror=all, so warnings outside -Wall become errors too -- including the
# preprocessor "redefined" warning the vendored ioLibrary trips (W5500's w5500.h
# defines MR, which collides with Xtensa specreg.h's MR). sdkconfig is
# gitignored, so without pinning it here the result depends on which IDF version
# happened to generate it first.
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# The Wi-Fi server needs one lwIP socket per listener PLUS one per accepted
# connection (MULTI_SOCKET_COUNT of each), which exceeds the default of 10.
# The Ethernet side is unaffected: TOE fds come from the chip's 8 hardware
# sockets and accept() reuses the listener fd.
CONFIG_LWIP_MAX_SOCKETS=16
# --- wsm_driver shared settings (copied from loopback) ---
CONFIG_WSM_DRIVER_ENABLED=y
CONFIG_WSM_DRIVER_CHIP_W6300=y
CONFIG_WSM_DRIVER_BACKEND_TOE=y
# pins/clock/QSPI come from the component Kconfig W6300 defaults
# Route BSD sockets to the WIZnet TOE hardware sockets (builds wiznet_toe.c /
# wiztoe_wrap.c and adds the lwIP --wrap glue).
CONFIG_WSM_DRIVER_SOCKET_WRAP=y
